Tekla Open API Reference for Tekla Structures 2025
InputDefinitionFactory.GetView Method
 Gets the view that the given input belongs to.
 Namespace: Tekla.Structures.Drawing.Tools
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static ViewBase GetView(
	DrawingPluginBase.InputDefinition input
)
Public Shared Function GetView (
	input As DrawingPluginBase.InputDefinition
) As ViewBase
Parameters
input
Type: Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition
The input.
Return Value
Type: ViewBase
The view.
See Also
Reference
InputDefinitionFactory Class
Tekla.Structures.Drawing.Tools Namespace